Microchip-MPLAB-Harmony/csp_apps_pic32cm_jh00_jh01/apps/nvmctrl/nvmctrl_flash_read_write/firmware/src/packs/PIC32CM5164JH00100_DFP/component/dsu.h
/* -------- DSU_DID : (DSU Offset: 0x18) ( R/ 32) Device Identification -------- */
#define DSU_DID_RESETVALUE                    _U_(0x1106000E)                                      /**<  (DSU_DID) Device Identification  Reset Value */

#define DSU_DID_DEVSEL_Pos                    _U_(0)                                               /**< (DSU_DID) Device Select Position */
#define DSU_DID_DEVSEL_Msk                    (_U_(0xFF) << DSU_DID_DEVSEL_Pos)                    /**< (DSU_DID) Device Select Mask */
#define DSU_DID_DEVSEL(value)                 (DSU_DID_DEVSEL_Msk & ((value) << DSU_DID_DEVSEL_Pos))
#define   DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN_Val _U_(0x0)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN_Val _U_(0x1)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN_Val _U_(0x2)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN_Val _U_(0x3)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN_Val _U_(0x4)                                             /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN_Val _U_(0x5)                                             /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN_Val _U_(0x6)                                             /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN_Val _U_(0x7)                                             /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_100PIN_CAN_Val _U_(0x8)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 100-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_64PIN_CAN_Val _U_(0x9)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 64-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val _U_(0xA)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN_Val _U_(0xB)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_100PIN_NOCAN_Val _U_(0xC)                                             /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 100-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN_Val _U_(0xD)                                             /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN_Val _U_(0xE)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN_Val _U_(0xF)                                             /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN_Val _U_(0x10)                                            /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / No CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_64PIN_NOCAN_Val _U_(0x11)                                            /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 64-pin / No CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_48PIN_NOCAN_Val _U_(0x12)                                            /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN_Val _U_(0x13)                                            /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN_Val _U_(0x14)                                            /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / No CAN  */
#define   DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN_Val _U_(0x15)                                            /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / No CAN  */
#define   DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN_Val _U_(0x16)                                            /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / No CAN  */
#define   DSU_DID_DEVSEL_128KB_16KB_32PIN_NOCAN_Val _U_(0x17)                                            /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / No CAN  */
#define DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN  (DSU_DID_DEVSEL_512KB_64KB_100PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_64PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN   (DSU_DID_DEVSEL_512KB_64KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN  (DSU_DID_DEVSEL_256KB_32KB_100PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_64PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN   (DSU_DID_DEVSEL_256KB_32KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_100PIN_CAN  (DSU_DID_DEVSEL_128KB_16KB_100PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 100-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_64PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_64PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 64-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_48PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN   (DSU_DID_DEVSEL_128KB_16KB_32PIN_CAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_100PIN_NOCAN (DSU_DID_DEVSEL_128KB_16KB_100PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 100-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_100PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 100-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_100PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 100-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_64PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 64-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_64PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 64-pin / No CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_64PIN_NOCAN (DSU_DID_DEVSEL_128KB_16KB_64PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 64-pin / No CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_48PIN_NOCAN (DSU_DID_DEVSEL_128KB_16KB_48PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 48-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_48PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 48-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_48PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 48-pin / No CAN Position  */
#define DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN (DSU_DID_DEVSEL_512KB_64KB_32PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 512 KB Flash / 64 KB SRAM / 32-pin / No CAN Position  */
#define DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN (DSU_DID_DEVSEL_256KB_32KB_32PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 256 KB Flash / 32 KB SRAM / 32-pin / No CAN Position  */
#define DSU_DID_DEVSEL_128KB_16KB_32PIN_NOCAN (DSU_DID_DEVSEL_128KB_16KB_32PIN_NOCAN_Val << DSU_DID_DEVSEL_Pos) /**< (DSU_DID) 128 KB Flash / 16 KB SRAM / 32-pin / No CAN Position  */
#define DSU_DID_REVISION_Pos                  _U_(8)                                               /**< (DSU_DID) Revision Number Position */
#define DSU_DID_REVISION_Msk                  (_U_(0xF) << DSU_DID_REVISION_Pos)                   /**< (DSU_DID) Revision Number Mask */
#define DSU_DID_REVISION(value)               (DSU_DID_REVISION_Msk & ((value) << DSU_DID_REVISION_Pos))
#define DSU_DID_DIE_Pos                       _U_(12)                                              /**< (DSU_DID) Die Number Position */
#define DSU_DID_DIE_Msk                       (_U_(0xF) << DSU_DID_DIE_Pos)                        /**< (DSU_DID) Die Number Mask */
#define DSU_DID_DIE(value)                    (DSU_DID_DIE_Msk & ((value) << DSU_DID_DIE_Pos))    
#define DSU_DID_SERIES_Pos                    _U_(16)                                              /**< (DSU_DID) Series Position */
#define DSU_DID_SERIES_Msk                    (_U_(0x3F) << DSU_DID_SERIES_Pos)                    /**< (DSU_DID) Series Mask */
#define DSU_DID_SERIES(value)                 (DSU_DID_SERIES_Msk & ((value) << DSU_DID_SERIES_Pos))
#define   DSU_DID_SERIES_JH00_JH01_Val        _U_(0x6)                                             /**< (DSU_DID) PIC32CM JH00 and PIC32CM JH01  */
#define DSU_DID_SERIES_JH00_JH01              (DSU_DID_SERIES_JH00_JH01_Val << DSU_DID_SERIES_Pos) /**< (DSU_DID) PIC32CM JH00 and PIC32CM JH01 Position  */
#define DSU_DID_FAMILY_Pos                    _U_(23)                                              /**< (DSU_DID) Family Position */
#define DSU_DID_FAMILY_Msk                    (_U_(0x1F) << DSU_DID_FAMILY_Pos)                    /**< (DSU_DID) Family Mask */
#define DSU_DID_FAMILY(value)                 (DSU_DID_FAMILY_Msk & ((value) << DSU_DID_FAMILY_Pos))
#define   DSU_DID_FAMILY_2_Val                _U_(0x2)                                             /**< (DSU_DID) 5V Industrial  */
#define DSU_DID_FAMILY_2                      (DSU_DID_FAMILY_2_Val << DSU_DID_FAMILY_Pos)         /**< (DSU_DID) 5V Industrial Position  */
#define DSU_DID_PROCESSOR_Pos                 _U_(28)                                              /**< (DSU_DID) Processor Position */
#define DSU_DID_PROCESSOR_Msk                 (_U_(0xF) << DSU_DID_PROCESSOR_Pos)                  /**< (DSU_DID) Processor Mask */
#define DSU_DID_PROCESSOR(value)              (DSU_DID_PROCESSOR_Msk & ((value) << DSU_DID_PROCESSOR_Pos))
#define   DSU_DID_PROCESSOR_1_Val             _U_(0x1)                                             /**< (DSU_DID) Cortex-M0+  */
#define DSU_DID_PROCESSOR_1                   (DSU_DID_PROCESSOR_1_Val << DSU_DID_PROCESSOR_Pos)   /**< (DSU_DID) Cortex-M0+ Position  */
#define DSU_DID_Msk                           _U_(0xFFBFFFFF)                                      /**< (DSU_DID) Register Mask  */


/* -------- DSU_ENTRY0 : (DSU Offset: 0x1000) ( R/ 32) CoreSight ROM Table Entry 0 -------- */
#define DSU_ENTRY0_RESETVALUE                 _U_(0x9F0FC002)                                      /**<  (DSU_ENTRY0) CoreSight ROM Table Entry 0  Reset Value */

#define DSU_ENTRY0_EPRES_Pos                  _U_(0)                                               /**< (DSU_ENTRY0) Entry Present Position */
#define DSU_ENTRY0_EPRES_Msk                  (_U_(0x1) << DSU_ENTRY0_EPRES_Pos)                   /**< (DSU_ENTRY0) Entry Present Mask */
#define DSU_ENTRY0_EPRES(value)               (DSU_ENTRY0_EPRES_Msk & ((value) << DSU_ENTRY0_EPRES_Pos))
#define DSU_ENTRY0_FMT_Pos                    _U_(1)                                               /**< (DSU_ENTRY0) Format Position */
#define DSU_ENTRY0_FMT_Msk                    (_U_(0x1) << DSU_ENTRY0_FMT_Pos)                     /**< (DSU_ENTRY0) Format Mask */
#define DSU_ENTRY0_FMT(value)                 (DSU_ENTRY0_FMT_Msk & ((value) << DSU_ENTRY0_FMT_Pos))
#define DSU_ENTRY0_ADDOFF_Pos                 _U_(12)                                              /**< (DSU_ENTRY0) Address Offset Position */
#define DSU_ENTRY0_ADDOFF_Msk                 (_U_(0xFFFFF) << DSU_ENTRY0_ADDOFF_Pos)              /**< (DSU_ENTRY0) Address Offset Mask */
#define DSU_ENTRY0_ADDOFF(value)              (DSU_ENTRY0_ADDOFF_Msk & ((value) << DSU_ENTRY0_ADDOFF_Pos))
#define DSU_ENTRY0_Msk                        _U_(0xFFFFF003)                                      /**< (DSU_ENTRY0) Register Mask  */


/* -------- DSU_ENTRY1 : (DSU Offset: 0x1004) ( R/ 32) CoreSight ROM Table Entry 1 -------- */
#define DSU_ENTRY1_RESETVALUE                 _U_(0x00)                                            /**<  (DSU_ENTRY1) CoreSight ROM Table Entry 1  Reset Value */

